# Завдання: порахуйте кількість літер строки. Строка та літера
#           даються на вхід користувачем. В залежності від кількости
#           виведіть на екран поясненя: строка містить літеру "с" до
#           10 разів, строка містить літеру "с" до 20 разid, строка містить
#           символ "c" більше 20 разів. Проінформуйте користувача якщо
#           введено більше ніж одну літеру (літера має довжину більше 1)
#           або повідомляти якщо такої літери взагалі не знайдено.
#
# Підказка:
# * input() - ввод від користувача
# * len(str) - довжина строки
# * str.count(letter) - підрахунок елементів (літер) letter
# * if - elif - else - для логіки виводу на екран
#
# Приклад:
#
# Введіть текст: Це якийсь рандомний текст
# Введіть літеру: й
# Строка містить літеру "й" до 10 разів.
#
# Введіть текст: аааааааааааааааааааааааа
# Введіть літеру: а
# Строка містить літеру "а" більше 20 разів.

text_input = str(input('Введіть текст:'))
letter_input = str(input('Введіть літеру:'))
count = text_input.count(letter_input)

if len(letter_input) != 1:
    exit(1)
# if len(letter_input) > 1:
#     print('Літера має довжину більше 1')
# elif len(letter_input) < 0:
#     print('Введіть літеру!')

if 0 < count <= 10:
    print(f'Строка містить літеру {letter_input} до 10 разів.')
elif 10 < count < 20:
    print(f'Строка містить літеру {letter_input} до 20 разів.')
elif count > 20:
    print(f'Строка містить літеру {letter_input} більше 20 разів.')
else:
    print(f'такої літери {letter_input} взагалі не знайдено.')
